Tekla.Structures.Catalogs.UserPropertyLevelEnum
The user property level.

Tekla.Structures.Catalogs.UserPropertyLevelEnum.LEVEL_MODEL
The user property has been defined as a model user property.

Tekla.Structures.Catalogs.UserPropertyLevelEnum.LEVEL_PROJECT
The user property has been defined as a project user property.

Tekla.Structures.Catalogs.UserPropertyLevelEnum.LEVEL_FIRM
The user property has been defined as a firm user property.

Tekla.Structures.Catalogs.UserPropertyLevelEnum.LEVEL_ENVIRONMENT
The user property has been defined as an environment user property.

Tekla.Structures.Catalogs.UserPropertyLevelEnum.LEVEL_COMMONDEFAULT
The user property has been defined as a common default user property.